- In pandas we can join two dataframes

    - merge
    
    - join
    
    - concatination

# merge

- it is under pandas the function: pd.merge

- it similar to SQL joins

- you can join with specific columns

In [1]:
import pandas as pd

d1={'ID':[1,2,3],
   'Name':['Chandu','pawan','Bansal']}

d2={'ID':[1,2,4],
   'Age':[20,25,30]}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

In [2]:
df1

   ID    Name
0   1  Chandu
1   2   pawan
2   3  Bansal

In [3]:
df2

   ID  Age
0   1   20
1   2   25
2   4   30

In [4]:
pd.merge(df1,df2,on='ID',how='inner')

   ID    Name  Age
0   1  Chandu   20
1   2   pawan   25

In [5]:
pd.merge(df1,df2,on='ID',how='outer')

   ID    Name   Age
0   1  Chandu  20.0
1   2   pawan  25.0
2   3  Bansal   NaN
3   4     NaN  30.0

In [6]:
pd.merge(df1,df2,on='ID',how='left')

   ID    Name   Age
0   1  Chandu  20.0
1   2   pawan  25.0
2   3  Bansal   NaN

In [7]:
pd.merge(df1,df2,on='ID',how='right')

   ID    Name  Age
0   1  Chandu   20
1   2   pawan   25
2   4     NaN   30

In [ ]:
## homework

df1.join(df2)